<template>
  <NuxtLayout name="home" :rightSidebar="false" :leftSidebar="false">
    <template #rightSidebar>{{ "" }}</template>
    <!-- <template #leftSidebar>{{ '' }}</template> -->
    <div class="lg:px-28">
      <v-card variant="flat" class="border-b">
        <v-card-text>
          <h1 class="text-3xl font-bold">গ্রাম - আমাদের বাংলার প্রাণ!</h1>

          <div class="pt-5">
            <div class="flex items-center gap-5 justify-between">
              <UserCardPopup />
              <div class="text-sm text-zinc-500">
                <span>২৪ জুলাই, ২০২২</span>
              </div>
            </div>
          </div>
        </v-card-text>

        <v-card-text>
          <v-img aspect-ratio="16/9" cover rounded
            src="https://archive.roar.media/wp-content/uploads/2024/01/Feature-Image.jpg" />
        </v-card-text>

        <v-card-text>
          <div class="text-lg">
            গত বছর কুরবনী ঈদের দিন সকাল থেকেই ঝুম বৃষ্টি। আমাদের গ্রামের বাড়িটার সামনে
            দিয়ে যে রাস্তাটা গেছে সেটা আধা কিলোমিটারের মত কাঁচা। এইটুকু রাস্তা এখনব্দি
            কাঁচা থাকার পেছনে বিশেষ একটি কারন রয়েছে। আমাদের ঐ এলাকায় বিএনপির উচ্চ শ্রেনীর
            কিছু মাতব্বর আছে। বংশ পরম্পরায় এরা বর্তমান সরকার বিরোধরী রাজনীতি করে আসছে।
            অন্যদিকে আমাদের উপজেলা চেয়ারম্যানের সাথে তাদের স্নায়ুযুদ্ধ চলমান। সে কথা যাক।
            ঈদের দিন খুব সকালে ঘুম থেকে উঠে গোসল সেরে পাঞ্জাবী পরে প্রস্তুত হলাম নামাজে
            যাওয়ার জন্য। বৃষ্টিতে আমাদের উঠান, কাঁচা রাস্তা সবকিছু কাদায় একাকার হয়ে গেছে।
            সে কাদা ডিঙ্গিয়ে গুটি গুটি পায়ে আব্বার পেছন পেছন আমি আর আমার ছোট ভাই হাটতে
            শুরু করলাম নিকটবর্তী মসজিদের দিকে। বৃষ্টির কারনে ঐদিন এলাকা ভিত্তিক মসজিদ
            গুলোতেই ঈদের নামাজ আদায়ের ব্যাবস্থা করা হয়েছিলো। নামাজের পর মোনাজাত শেষ করতে
            করতে কিছুটা বেশি সময় লেগে যায়। এদিকে বাড়ি ফিরে গোরুটাকে গোসল করিয়ে কুরবানীর
            জন্য প্রস্তুত করতে হবে। তাই মসজিদ থেকে বেরিয়ে একটু জলদিই হাটতে শুরু করলাম।
            আব্বা আর ছোট ভাই হাটতে হটাতে অনেকটা সামনে এগিয়ে গেলো। আমি পায়ে কাদা লাগাবনা
            বলে পা টিপে টিপে খুব সাবধানে হাটতে লাগলাম। পুরোটা রাস্তা ভালোভাবে পার হয়ে
            আসলাম। কিন্তু রাস্তা থেকে বাড়ির উঠানে নামার ঢালু জায়গাটিতে এসেই আমি হাতের ছাতা
            আর জায়নামাজ সমেত পিছলা খেয়ে ধপাস করে আছাড় খেলাম। মাটিতে বসে পড়েই এদিকে সেদিকে
            তাকিয়ে দেখে নিলাম কেউ আবার ঘটনাটির সাক্ষী হলো কিনা। ঐযে কথায় আছে, যেখানেই
            বাঘের ভয় সেখানেই সন্ধ্যে হয়। তাকিয়ে দেখি বাড়ির সদর দরজায় আমার বউ দাড়িয়ে মুখ
            টিপে হাসছে। মনে মনে একটু রাগ হলো। এই সময়েই তাকে ওখানে দাড়িয়ে থাকতে কে বললো।
            রাগে গিজ গিজ করতে করতে আবারো উঠে দাড়াতে যাবো সাথে সাথেই খেলাম আরেক আছাড়। পর পর
            দুই আছাড় খেয়ে আমার খয়েরী রঙের পাঞ্জাবীটার বেহাল দসা হলো। এবার সত্যি সত্যি আমার
            ভীষণ রাগ হলো। রাগের পরিমান এতটায় ছিলো যে আমি আর উঠে দাড়ানোর চেষ্টা না করে
            ওভাবেই বসে রইলাম মাটিতে। বউ আমার বেগতিক অবস্তা বুঝে হাসি থামিয়ে একটা ছাতা হাতে
            নিয়ে ছুটে আসলো। সে আমার হাত ধরে টেনে উঠানোর চেষ্টা করলো কয়েকবার। কিন্তু পারলো
            না। ষাট কেজি ওজনের একটা মেয়ে পঁচাত্তর কেজি ওজনের একটা মানুষকে টেনে উঠাতে পারে
            সেটি শুধু সিনেমাতেই দেখা যায়। বাস্তবে এটি সম্ভব না। অন্যদিকে আমি'তো উঠবোই না।
            মস্তিষ্কে জিদ চেপে গেছে। পরপর দুটো আছাড় খেলাম, তা'ও আবার বউয়ের সামনে। মনে জিদ
            তো আসবেই। বউ কিছুক্ষন টানাটানি করে অবশেষে হাল ছাড়লো। আমি ওভাবেই বসে রইলাম।
            পাশে বউটি চুপচাপ দাড়িয়ে রইলো। এভাবে কিছুক্ষন পার হবার পর দেখি মসজিদের হুজুর
            চলে এসেছে। হাতে দু-হাত লম্বা একটি বাঁকা ছুরি। রাম্তার মাথা থেকে সিরিয়াল দিয়ে
            গোরু জবাই করতে করতে এসেছে। এবার আমাদের গোরুর পালা। হুজুরকে দেখে বউ তাড়াতাড়ি
            করে বাড়ির ভেতরে চলে গেলো। হুজুর আমার অবস্থা দেখে ফিক করে হেসে দিলো। "সে কি
            উল্লাস ভাই! সাবধানে হাটবেনতো! এই বয়সে আছাড় খাওয়া মানায় নাকি!" ঐ সময় ইচ্ছে
            করছিলো একটা মুগুর হাতে নিয়ে লোকটাকে দৌড়ানি দিই। কিন্তু রাস্তার যে হাল হয়েছে
            তাতে দৌড়ানিতো দুরে থাক, সাবধানে হাটতে গিয়েইতো আমার এই পরিনতি হয়েছে। তাছাড়া
            হুজুর দৌড়ানি খেয়ে চলে গেলে কুরবানী দিতে দিতে অনেকটা দেরি হয়ে যাবে। তাই
            অনাবশ্যক ভদ্রতা দেখিয়ে হুজুরকে সালাম দিলাম। হুজুর দাঁত কেলিয়ে হাসতে হাসতেই
            সালামের উত্তর দিয়ে কাছে এগিয়ে এসে হাত বাড়িয়ে দিলেন। ততক্ষনে আব্বা, ছোট ভাই আর
            আসেপাশে কয়েকজন মিলে গোরুটিকে প্রস্তুত করে ফেলেছে। বৃষ্টির অবস্থা তখনও বেগতিক।
            মুষলধারে রিমঝিম শব্দে বৃষ্টি পড়ছে সেই সকাল থেকেই। আমার বৃষ্টি খুব বেশিই পছন্দ।
            শুধু আমার বললে ভুল হবে। আমার মনে হয় নব্বই পারসেন্ট মানুষেরই বৃষ্টি পছন্দ। যখন
            মেঘের ঘনঘটায় আকাশ ছেয়ে বর্ষার আগমন হয়, যখন টিনের চালে রিমিঝিমি শব্দে ছন্দময়
            সুর বেজে ওঠে। এই অপরুপ নির্ঝরা সময়টি কে না ভালোবাসে। বর্ষার আগমন প্রতিটা
            হৃদয়েই প্রেম জাগায়। প্রনয় সৃষ্টি করে। সে প্রনয়ে ভেসে যায় মনের বিশন্নতা।
            পরিশ্রান্ত হয় শরীরের ক্লান্তি। কিন্তু ঈদের দিন বৃষ্টি হোক তা কেউ চায় না। অল্প
            বয়সী মেয়েরা এই দিনটিতেই মনের মত করে সেজেগুজে বাহিরে বের হয়। এদিক সেদিক ঘুরে
            বেড়ায়। ছেলেরা ব্যাস্ত হয়ে পড়ে গোরুর সাথে। সবাই গোল হয়ে পিড়িতে বসে মাংস কাটে।
            কেউ বটি নিয়ে বসে যায়, আবার কেউ ছুরি নিয়ে। কসাই কাজে কে কতটা দক্ষ তা প্রদর্শন
            করার জন্য এটিই একটি বিশেষ দিন। আর এই দিনটিতেই যদি সকাল থেকে এভাবে বৃষ্টি হতে
            থাকে তাহলে কার'ই বা মন ভালো থাকে! তার উপরে যদি কেউ বউয়ের সামনে ধপাস ধপাস করে
            পরপর দুটি আছাড় খায়! গোরুর মাংস কাটাকটির মাঝে একবার নিজের রুমে এলাম। চার্জার
            থেকে মোবাইলটা খুলে হাতে নিতেই দেখি মেসেঞ্জারে শালিকার মেসেজ, "ভাইয়া বেশি
            ব্যাথা পাইছেন নাকি?" এবার বউটির উপর ভীষণ রাগ হলো। তবে তারসাথে আমি খুব একটা
            বিবাদে জড়াই না। জড়ালে নিজেরই ক্ষতি। অন্যান্য ক্ষতির কথা বাদ দিলেও আগামী তিনদিন
            যে সময় মত "চা" পাবোনা সে ব্যাপারে আমি নিশ্চিন্ত। দুপুরে একটা বিকট ঘুম দিলাম।
            এক ঘুমেই সন্ধ্যে পার হলো। ফোন হাতে নিয়ে দেখি কম করে হলেও দুই ডজন মিসকল।
            বন্ধুদের মধ্যে কেউ দুবার কেউ তিনবার করে ফোন করেছে। বাড়ি থেকে বের হতে একটু দেরি
            হলেও পুরানো আড্ডার জায়গাই গিয়ে দেখি সেখানে সকলেই উপস্থিত। আমাকে দেখে একজন বলে
            উঠলো, "কিরে ব্যাটা! বউয়ের সামনে আছাড় খাইলি কেমনে?" ওর কথা শুনে কিছু বললাম না।
            গম্ভীর হয়ে একপাশে বসে একটা সীগারেট ধরালাম। ঐ সময় আমার হুজুরের কথা মনে পড়ছে।
            বেটারে পাইলে আমি সত্যি সত্যি মুগুর নিয়ে দৌড়ানি দেবো।
          </div>
        </v-card-text>
      </v-card>

      <v-card variant="flat" class="mb-5">
        <v-card-text>
          <div class="flex flex-col lg:flex-row gap-5 lg:items-center justify-between">
            <div class="flex gap-5 items-center">
              <v-btn density="default" variant="tonal" color="green" icon>
                <Icon name="bi:hand-thumbs-up" size="25" />
              </v-btn>
              <div>
                <UAvatarGroup size="sm" :max="2">
                  <UAvatar src="https://avatars.githubusercontent.com/u/739984?v=4" alt="benjamincanac" />
                  <UAvatar src="https://avatars.githubusercontent.com/u/904724?v=4" alt="Atinux" />
                  <UAvatar src="https://avatars.githubusercontent.com/u/7547335?v=4" alt="smarroufin" />
                  <UAvatar src="https://avatars.githubusercontent.com/u/904724?v=4" alt="Atinux" />
                  <UAvatar src="https://avatars.githubusercontent.com/u/7547335?v=4" alt="smarroufin" />
                </UAvatarGroup>
              </div>
            </div>

            <div class="flex flex-wrap gap-2 lg:gap-5 items-center text-zinc-900">
              <v-chip>২৮ লাইক</v-chip>
              <v-chip>২০ মন্তব্য</v-chip>
            </div>
          </div>
        </v-card-text>
      </v-card>

      <v-card variant="flat">
        <v-card-text>
          <v-textarea label="মন্তব্য লিখুন" row-height="25" rows="3" variant="outlined" auto-grow shaped></v-textarea>

          <div>
            <v-btn class="text-none mb-4" color="indigo-darken-3" variant="flat">
              মন্তব্য পোস্ট করুন
            </v-btn>
          </div>
        </v-card-text>
      </v-card>

      <v-card title="সকল মন্তব্য ক্রমানুসারে" variant="flat">
        <v-card-text>
          <div v-for="(comment, index) in comments" :key="index">
            <CommentCard :comment="comment" />
          </div>
        </v-card-text>
      </v-card>
    </div>
  </NuxtLayout>
</template>

<script lang="ts" setup>
const menu = ref(false);

const comments = [
  {
    id: 1,
    user: {
      name: "মোস্তাফিজ রহমান",
      image: "https://avatars.githubusercontent.com/u/739981?v=4",
    },
    text:
      "বাস যখন ধীরে ধীরে এগিয়ে যেতে শুরু করেছে তখনি আরাফ ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
    date: "২ দিন আগে",
    like: "২২",
    comments: [
      {
        id: 4,
        parent_id: 1,
        user: {
          name: "লিমন শেখ",
          image: "https://avatars.githubusercontent.com/u/739980?v=4",
        },
        text:
          "বাস যখন ধীরে ধীরে এগিয়ে যেতে শুরু করেছে তখনি আরাফ ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "২২",
        comments: [],
      },

      {
        id: 5,
        parent_id: 1,
        user: {
          name: "আরমান মল্লিক",
          image: "https://avatars.githubusercontent.com/u/739979?v=4",
        },
        text:
          "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "২২",
        comments: [
          {
            id: 10,
            parent_id: 5,
            user: {
              name: "লিমন শেখ",
              image: "https://avatars.githubusercontent.com/u/739980?v=4",
            },
            text:
              "বাস যখন ধীরে ধীরে এগিয়ে যেতে শুরু করেছে তখনি আরাফ ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
            date: "২ দিন আগে",
            like: "২২",
            comments: [
              {
                id: 15,
                parent_id: 10,
                user: {
                  name: "লিমন শেখ",
                  image: "https://avatars.githubusercontent.com/u/739980?v=4",
                },
                text:
                  "বাস যখন ধীরে ধীরে এগিয়ে যেতে শুরু করেছে তখনি আরাফ ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
                date: "২ দিন আগে",
                like: "২২",
                comments: [],
              },

            ],
          },

          {
            id: 12,
            parent_id: 5,
            user: {
              name: "নারগিস সুলতানা",
              image: "https://avatars.githubusercontent.com/u/739978?v=2",
            },
            text:
              "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
            date: "২ দিন আগে",
            like: "১২",
            comments: [],
          },

          {
            id: 11,
            parent_id: 5,
            user: {
              name: "আরমান মল্লিক",
              image: "https://avatars.githubusercontent.com/u/739979?v=4",
            },
            text:
              "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
            date: "২ দিন আগে",
            like: "২২",
            comments: [],
          },


        ],
      },

      {
        id: 6,
        parent_id: 1,
        user: {
          name: "নারগিস সুলতানা",
          image: "https://avatars.githubusercontent.com/u/739978?v=2",
        },
        text:
          "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "১২",
        comments: [],
      },
    ],
  },

  {
    id: 2,
    user: {
      name: "আনোয়ার ইসলাম",
      image: "https://avatars.githubusercontent.com/u/739982?v=4",
    },
    text:
      "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
    date: "২ দিন আগে",
    like: "২২",
    comments: [
      {
        id: 7,
        parent_id: 2,
        user: {
          name: "লিমন শেখ",
          image: "https://avatars.githubusercontent.com/u/739980?v=4",
        },
        text:
          "বাস যখন ধীরে ধীরে এগিয়ে যেতে শুরু করেছে তখনি আরাফ ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "২২",
        comments: [],
      },

      {
        id: 8,
        parent_id: 2,
        user: {
          name: "আরমান মল্লিক",
          image: "https://avatars.githubusercontent.com/u/739979?v=4",
        },
        text:
          "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "২২",
        comments: [],
      },

      {
        id: 9,
        parent_id: 2,
        user: {
          name: "নারগিস সুলতানা",
          image: "https://avatars.githubusercontent.com/u/739978?v=2",
        },
        text:
          "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
        date: "২ দিন আগে",
        like: "১২",
        comments: [],
      },
    ],
  },

  {
    id: 3,
    user: {
      name: "ঈশিতা বিনতে",
      image: "https://avatars.githubusercontent.com/u/739985?v=2",
    },
    text:
      "ব্যাগ কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে বাসের দরজায় উঠে পড়ে। কাঁধে দৌড়াতে দৌড়াতে লাফ দিয়ে আরেকটু হলেই মিস হয়ে যেত বাসটা। অনলাইনে আগে থেকে",
    date: "২ দিন আগে",
    like: "১২",
    comments: []
  },
];
</script>

<style></style>
